Repository: michael2to3/bot_send_fake_location_for_bot_chess_tg
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

# auth_code_not_sent
source: Oops! 😅 The authentication code wasn't sent. Please try again.
ru: Ой! 😅 Код аутентификации не был отправлен. Пожалуйста, попробуйте еще раз.

# auth_code_sent
source: Great! 🎉 The authentication code has been sent. Check your messages. Use /code to change it *⚠️ Warning*: By creating an authentication session, you are granting this bot full access to your Telegram account. This includes the ability to read your messages, send messages on your behalf, and manage your account. Please ensure you trust the bot and its developers before proceeding. If you have any concerns, please review the bot's source code or contact the developers directly.
ru: Отлично! 🎉 Код аутентификации отправлен. Проверьте свои сообщения. Используйте /code для изменения *⚠️ Внимание*: Создавая сессию аутентификации, вы предоставляете этому боту полный доступ к вашему аккаунту Telegram. Это включает возможность чтения ваших сообщений, отправки сообщений от вашего имени и управления вашим аккаунтом. Пожалуйста, убедитесь, что вы доверяете боту и его разработчикам, прежде чем продолжить. Если у вас есть какие-либо опасения, пожалуйста, ознакомьтесь с исходным кодом бота или свяжитесь с разработчиками напрямую.

# connection_error
source: Uh-oh! 😓 We're experiencing connection issues. Please try again later.
ru: Ой! 😓 У нас проблемы с подключением. Пожалуйста, попробуйте позже.

# cron_disabled
source: Cron has been successfully disabled! 🛑
ru: Cron успешно отключен! 🛑

# cron_enabled
source: Cron is now enabled! 🟢 Let's get things rolling!
ru: Cron теперь включен! 🟢 Поехали!

# cron_invalid_expression
source: Oops! 😅 The provided cron expression is invalid. Please double-check and try again.
ru: Ой! 😅 Введенное выражение cron неверно. Пожалуйста, проверьте и попробуйте еще раз.

# cron_not_initialized
source: Cron hasn't been initialized yet! 😮 Please set it up first.
ru: Cron еще не инициализирован! 😮 Пожалуйста, сначала настройте его.

# cron_set_schedule
source: Cron schedule has been set! ⏰
ru: Расписание Cron установлено! ⏰

# cron_show_expression
source: Here's the current cron expression: {}
ru: Вот текущее выражение cron: {}

# database_error
source: Yikes! 😬 We encountered a database error. Please try again later.
ru: Ой! 😬 У нас возникла ошибка базы данных. Пожалуйста, попробуйте позже.

# enter_auth_code
source: Please enter the authentication code you received 📨:
ru: Пожалуйста, введите полученный код аутентификации 📨:

# enter_phone
source: Please enter your phone number 📞:
ru: Пожалуйста, введите свой номер телефона 📞:

# flood_wait_error
source: Hold on! ⏱️ We need to wait due to flood restrictions. Please try again later. {} seconds
ru: Подождите! ⏱️ Нам нужно подождать из-за ограничений на отправку сообщений. Пожалуйста, попробуйте позже. {} секунд

# help
source: /start - Start the bot 🚀 /help - Show this help message 📚 /auth PHONE_NUMBER - Authenticate with your phone number 📱 Example: /auth +79992132533 /code CODE - Enter the received code 🔢 Example: /code 2.8.2.0.4 /schedule CRON - Set a message sending schedule with a cron expression ⏰ Example: /schedule 30 18 * * 5 /send - Send your fake geolocation now 🌐 Example: /send /disable - Disable a autosending 🔕 Example: /disable /enable - Enable a autosending 🔔 Example: /enable /delete - Delete your token and all related data 🗑️ Example: /delete /location - Set or update your fake geolocation coordinates 📍 Example: /location 37.7749 -122.4194 100 Example: /location 37.7749 -122.4194 /recipient - Set or update the recipient for the fake geolocation 🎯 Example: /recipient @username /reauth - Reauthenticate with your phone number if needed 🔄 Example: /reauth /info - Get information about your current settings ℹ️ Example: /info /language - Set or update the bot language 🌍 Example: /language en Cron help website: https://cron.help/#30_18_*_*_5 More info: https://github.com/michael2to3/fakegeo-polychessbot Support: https://t.me/+EGnT6v3APokxMGYy
ru: /start - Запустить бота 🚀 /help - Показать это сообщение справки 📚 /auth PHONE_NUMBER - Аутентификация с помощью вашего номера телефона 📱 Пример: /auth +79992132533 /code CODE - Введите полученный код 🔢 Пример: /code 2.8.2.0.4 /schedule CRON - Установить расписание отправки сообщений с помощью выражения cron ⏰ Пример: /schedule 30 18 * * 5 /send - Отправить ваше поддельное геоместоположение сейчас 🌐 Пример: /send /disable - Отключить команду или функцию 🔕 Пример: /disable send /enable - Включить команду или функцию 🔔 Пример: /enable send /delete - Удалить ваш токен и все связанные данные 🗑️ Пример: /delete /location - Установить или обновить координаты вашего поддельного геоместоположения 📍 Пример: /location 37.7749 -122.4194 /recipient - Установить или обновить получателя поддельного геоместоположения 🎯 Пример: /recipient @username /reauth - Повторно авторизоваться с вашим номером телефона, если это необходимо 🔄 Пример: /reauth /info - Получить информацию о ваших текущих настройках ℹ️ Пример: /info /language - Установить или обновить язык бота 🌍 Пример: /language en Сайт справки по Cron: https://cron.help/#30_18_*_*_5 Дополнительная информация: https://github.com/michael2to3/fakegeo-polychessbot Поддержка: https://t.me/+EGnT6v3APokxMGYy

# language_set
source: Language has been successfully set! 🌐
ru: Язык успешно установлен! 🌐

# language_show
source: The current available languages are: {}
ru: Текущий язык: {}

# location_show
source: Here's your current location 📍: {}
ru: Вот ваше текущее местоположение 📍: {}

# need_location
source: Please share your location or set it manually 🌍:
ru: Пожалуйста, поделитесь своим местоположением или установите его вручную 🌍:

# need_recipient
source: Please specify a recipient 🎯:
ru: Пожалуйста, укажите получателя 🎯:

# show_recipient
source: Here's your recipient 🎯: {}
ru: Вот ваш получатель 🎯: {}

# reauth_message
source: Your session overwritten! 🔄 Use /code to change code
ru: Ваша сессия перезаписана! 🔄 Используйте /code для изменения кода ⚠️ Внимание: Создавая сессию аутентификации, вы предоставляете этому боту полный доступ к вашему аккаунту Telegram. Это включает возможность чтения ваших сообщений, отправки сообщений от вашего имени и управ ления вашим аккаунтом. Пожалуйста, убедитесь, что вы доверяете боту и его разработчикам, прежде чем продолжить. Если у вас есть какие-либо опасения, пожалуйста, ознакомьтесь с исходным кодом бота или свяжитесь с разработчиками напрямую.

# recipient_not_change_username
source: The recipient cannot change their username at this time. 🚫
ru: Получатель не может изменить свое имя пользователя в данный момент. 🚫

# recipient_not_specified
source: No recipient specified! 😕 Please choose one.
ru: Получатель не указан! 😕 Пожалуйста, выберите его.

# start
source: Hi there! 🤖 To enable this feature, follow these steps: 1) Authenticate by typing: /auth {YOUR_PHONE_NUMBER} Example: /auth +79992132533 2) Enter the code you receive as: /code {CODE} Example: If the code is 28204, enter: /code 2.8.2.0.4 You can try send message manual now by typing: /send To show help message, type: /help Need help with cron expressions? Visit: https://cron.help/ For more information, check the GitHub repository: https://github.com/michael2to3/fakegeo-polychessbot
ru: Привет! 🤖 Чтобы включить эту функцию, выполните следующие шаги: 1) Аутентифицируйтесь, введя: /auth {YOUR_PHONE_NUMBER} Пример: /auth +79992132533 2) Введите полученный код: /code {CODE} Пример: Если код 28204, введите: /code 2.8.2.0.4 Вы можете попробовать отправить сообщение вручную, введя: /send Чтобы показать сообщение справки, введите: /help Нужна помощь с выражениями cron? Посетите: https://cron.help/ Для получения дополнительной информации проверьте репозиторий GitHub: https://github.com/michael2to3/fakegeo-polychessbot

# success
source: Success! 🥳 Everything went smoothly.
ru: Успех! 🥳 Все прошло гладко.

# unknown_command
source: Hmm... 🤔 I don't recognize that command. Please try again.
ru: Хм... 🤔 Я не узнаю эту команду. Пожалуйста, попробуйте еще раз.

# unknown_error
source: Something went wrong! 😓 Please try again later.
ru: Что-то пошло не так! 😓 Пожалуйста, попробуйте позже.

# user_already_registered
source: You're already registered! ✅ No need to do it again.
ru: Вы уже зарегистрированы! ✅ Нет необходимости делать это снова.

# user_deleted
source: User has been successfully deleted. 🗑️
ru: Пользователь успешно удален. 🗑️

# user_not_change_phone
source: The user cannot change their phone number at this time. 🚫
ru: Пользователь не может изменить свой номер телефона в данный момент. 🚫

# user_not_found
source: User not found! 😕 Please double-check and try again.
ru: Пользователь не найден! 😕 Пожалуйста, проверьте и попробуйте еще раз.

# value_error
source: Oops! 😅 There's a value error. Please check your input and try again. {}
ru: Ой! 😅 Ошибка значения. Пожалуйста, проверьте ввод и попробуйте еще раз. {}
